Revit 2026 API

# ControlledApplicationOpenSharedParameterFile Method

---
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DefinitionFile OpenSharedParameterFile()
```
```vb
Public Function OpenSharedParameterFile As DefinitionFile
```
```cpp
public:
DefinitionFile^ OpenSharedParameterFile()
```
```fsharp
member OpenSharedParameterFile : unit -> DefinitionFile
```

#### Return Value

DefinitionFile

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace